# 1 "/tmp/temp_07ws3G.c"
# 1 "<built-in>" 1
# 1 "<built-in>" 3
#define __llvm__ 1
#define __clang__ 1
#define __clang_major__ 14
#define __clang_minor__ 0
#define __clang_patchlevel__ 0
#define __clang_version__ "14.0.0 "
#define __GNUC__ 4
#define __GNUC_MINOR__ 2
#define __GNUC_PATCHLEVEL__ 1
#define __GXX_ABI_VERSION 1002
#define __ATOMIC_RELAXED 0
#define __ATOMIC_CONSUME 1
#define __ATOMIC_ACQUIRE 2
#define __ATOMIC_RELEASE 3
#define __ATOMIC_ACQ_REL 4
#define __ATOMIC_SEQ_CST 5
#define __OPENCL_MEMORY_SCOPE_WORK_ITEM 0
#define __OPENCL_MEMORY_SCOPE_WORK_GROUP 1
#define __OPENCL_MEMORY_SCOPE_DEVICE 2
#define __OPENCL_MEMORY_SCOPE_ALL_SVM_DEVICES 3
#define __OPENCL_MEMORY_SCOPE_SUB_GROUP 4
#define __PRAGMA_REDEFINE_EXTNAME 1
#define __VERSION__ "Ubuntu Clang 14.0.0"
#define __OBJC_BOOL_IS_BOOL 0
#define __CONSTANT_CFSTRINGS__ 1
#define __clang_literal_encoding__ "UTF-8"
#define __clang_wide_literal_encoding__ "UTF-32"
#define __ORDER_LITTLE_ENDIAN__ 1234
#define __ORDER_BIG_ENDIAN__ 4321
#define __ORDER_PDP_ENDIAN__ 3412
#define __BYTE_ORDER__ __ORDER_LITTLE_ENDIAN__
#define __LITTLE_ENDIAN__ 1
#define _LP64 1
#define __LP64__ 1
#define __CHAR_BIT__ 8
#define __BOOL_WIDTH__ 8
#define __SHRT_WIDTH__ 16
#define __INT_WIDTH__ 32
#define __LONG_WIDTH__ 64
#define __LLONG_WIDTH__ 64
#define __BITINT_MAXWIDTH__ 128
#define __SCHAR_MAX__ 127
#define __SHRT_MAX__ 32767
#define __INT_MAX__ 2147483647
#define __LONG_MAX__ 9223372036854775807L

#define __linux 1
#define __linux__ 1
#define __ELF__ 1
#define __gnu_linux__ 1
#define __FLOAT128__ 1
#define __STDC__ 1
#define __STDC_HOSTED__ 1
#define __STDC_VERSION__ 201710L
#define __STDC_UTF_16__ 1
#define __STDC_UTF_32__ 1
# 1 "<command line>" 1
#define __GCC_HAVE_DWARF2_CFI_ASM 1
# 1 "<built-in>" 2
# 1 "/tmp/temp_07ws3G.c" 2
# 1 "./macros_behemot.h" 1
#define __builtin_va_list int
#define __attribute__(x) 
#define __asm__(x) 
#define __restrict 
#define __extension__ 
#define __inline 

#define NO_MSABI_VA_FUNCS 
# 2 "/tmp/temp_07ws3G.c" 2
# 1 "./edk2/MdePkg/Include/PiPei.h" 1
# 15 "./edk2/MdePkg/Include/PiPei.h"
#define __PI_PEI_H__ 

# 1 "./edk2/MdePkg/Include/Uefi/UefiBaseType.h" 1
# 14 "./edk2/MdePkg/Include/Uefi/UefiBaseType.h"
#define __UEFI_BASETYPE_H__ 

# 1 "./edk2/MdePkg/Include/Base.h" 1
# 16 "./edk2/MdePkg/Include/Base.h"
#define __BASE_H__ 




# 1 "./edk2/MdePkg/Include/X64/ProcessorBind.h" 1
# 10 "./edk2/MdePkg/Include/X64/ProcessorBind.h"
#define __PROCESSOR_BIND_H__ 




#define MDE_CPU_X64 
# 162 "./edk2/MdePkg/Include/X64/ProcessorBind.h"
typedef unsigned long long UINT64;



typedef long long INT64;



typedef unsigned int UINT32;



typedef int INT32;



typedef unsigned short UINT16;




typedef unsigned short CHAR16;



typedef short INT16;




typedef unsigned char BOOLEAN;



typedef unsigned char UINT8;



typedef char CHAR8;



typedef signed char INT8;






typedef UINT64 UINTN;




typedef INT64 INTN;








#define MAX_BIT 0x8000000000000000ULL



#define MAX_2_BITS 0xC000000000000000ULL




#define MAX_ADDRESS 0xFFFFFFFFFFFFFFFFULL




#define MAX_ALLOC_ADDRESS MAX_ADDRESS




#define MAX_INTN ((INTN)0x7FFFFFFFFFFFFFFFULL)
#define MAX_UINTN ((UINTN)0xFFFFFFFFFFFFFFFFULL)




#define MIN_INTN (((INTN)-9223372036854775807LL) - 1)




#define CPU_STACK_ALIGNMENT 16




#define DEFAULT_PAGE_ALLOCATION_GRANULARITY (0x1000)
#define RUNTIME_PAGE_ALLOCATION_GRANULARITY (0x1000)
# 286 "./edk2/MdePkg/Include/X64/ProcessorBind.h"
#define EFIAPI 
# 300 "./edk2/MdePkg/Include/X64/ProcessorBind.h"
#define ASM_GLOBAL .globl
# 313 "./edk2/MdePkg/Include/X64/ProcessorBind.h"
#define FUNCTION_ENTRY_POINT(FunctionPointer) (VOID *)(UINTN)(FunctionPointer)
# 22 "./edk2/MdePkg/Include/Base.h" 2
# 48 "./edk2/MdePkg/Include/Base.h"
#define GLOBAL_REMOVE_IF_UNREFERENCED 
# 61 "./edk2/MdePkg/Include/Base.h"
#define UNREACHABLE() __builtin_unreachable()
# 93 "./edk2/MdePkg/Include/Base.h"
#define NORETURN __attribute__((noreturn))
# 131 "./edk2/MdePkg/Include/Base.h"
#define ANALYZER_UNREACHABLE() 
# 148 "./edk2/MdePkg/Include/Base.h"
#define ANALYZER_NORETURN __attribute__((analyzer_noreturn))
# 171 "./edk2/MdePkg/Include/Base.h"
#define RETURNS_TWICE __attribute__((returns_twice))
# 188 "./edk2/MdePkg/Include/Base.h"
#define _CONCATENATE(a,b) __CONCATENATE(a, b)
#define __CONCATENATE(a,b) a##b





#define ASM_PFX(name) _CONCATENATE(__USER_LABEL_PREFIX__, name)








#define ASM_FUNCTION_REMOVE_IF_UNREFERENCED 


#define PACKED 





typedef struct
{
  UINT32 Data1;
  UINT16 Data2;
  UINT16 Data3;
  UINT8 Data4[8];
} GUID;




typedef struct
{
  UINT8 Addr[4];
} IPv4_ADDRESS;




typedef struct
{
  UINT8 Addr[16];
} IPv6_ADDRESS;




typedef UINT64 PHYSICAL_ADDRESS;




typedef struct _LIST_ENTRY LIST_ENTRY;




struct _LIST_ENTRY
{
  LIST_ENTRY *ForwardLink;
  LIST_ENTRY *BackLink;
};








#define CONST const




#define STATIC static




#define VOID void
# 283 "./edk2/MdePkg/Include/Base.h"
#define IN 




#define OUT 





#define OPTIONAL 
# 305 "./edk2/MdePkg/Include/Base.h"
#define TRUE ((BOOLEAN)(1 == 1))





#define FALSE ((BOOLEAN)(0 == 1))
# 328 "./edk2/MdePkg/Include/Base.h"
#define CHAR_NULL 0x0000




#define MAX_INT8 ((INT8)0x7F)
#define MAX_UINT8 ((UINT8)0xFF)
#define MAX_INT16 ((INT16)0x7FFF)
#define MAX_UINT16 ((UINT16)0xFFFF)
#define MAX_INT32 ((INT32)0x7FFFFFFF)
#define MAX_UINT32 ((UINT32)0xFFFFFFFF)
#define MAX_INT64 ((INT64)0x7FFFFFFFFFFFFFFFULL)
#define MAX_UINT64 ((UINT64)0xFFFFFFFFFFFFFFFFULL)




#define MIN_INT8 (((INT8) - 127) - 1)
#define MIN_INT16 (((INT16) - 32767) - 1)
#define MIN_INT32 (((INT32) - 2147483647) - 1)
#define MIN_INT64 (((INT64) - 9223372036854775807LL) - 1)

#define BIT0 0x00000001
#define BIT1 0x00000002
#define BIT2 0x00000004
#define BIT3 0x00000008
#define BIT4 0x00000010
#define BIT5 0x00000020
#define BIT6 0x00000040
#define BIT7 0x00000080
#define BIT8 0x00000100
#define BIT9 0x00000200
#define BIT10 0x00000400
#define BIT11 0x00000800
#define BIT12 0x00001000
#define BIT13 0x00002000
#define BIT14 0x00004000
#define BIT15 0x00008000
#define BIT16 0x00010000
#define BIT17 0x00020000
#define BIT18 0x00040000
#define BIT19 0x00080000
#define BIT20 0x00100000
#define BIT21 0x00200000
#define BIT22 0x00400000
#define BIT23 0x00800000
#define BIT24 0x01000000
#define BIT25 0x02000000
#define BIT26 0x04000000
#define BIT27 0x08000000
#define BIT28 0x10000000
#define BIT29 0x20000000
#define BIT30 0x40000000
#define BIT31 0x80000000
#define BIT32 0x0000000100000000ULL
#define BIT33 0x0000000200000000ULL
#define BIT34 0x0000000400000000ULL
#define BIT35 0x0000000800000000ULL
#define BIT36 0x0000001000000000ULL
#define BIT37 0x0000002000000000ULL
#define BIT38 0x0000004000000000ULL
#define BIT39 0x0000008000000000ULL
#define BIT40 0x0000010000000000ULL
#define BIT41 0x0000020000000000ULL
#define BIT42 0x0000040000000000ULL
#define BIT43 0x0000080000000000ULL
#define BIT44 0x0000100000000000ULL
#define BIT45 0x0000200000000000ULL
#define BIT46 0x0000400000000000ULL
#define BIT47 0x0000800000000000ULL
#define BIT48 0x0001000000000000ULL
#define BIT49 0x0002000000000000ULL
#define BIT50 0x0004000000000000ULL
#define BIT51 0x0008000000000000ULL
#define BIT52 0x0010000000000000ULL
#define BIT53 0x0020000000000000ULL
#define BIT54 0x0040000000000000ULL
#define BIT55 0x0080000000000000ULL
#define BIT56 0x0100000000000000ULL
#define BIT57 0x0200000000000000ULL
#define BIT58 0x0400000000000000ULL
#define BIT59 0x0800000000000000ULL
#define BIT60 0x1000000000000000ULL
#define BIT61 0x2000000000000000ULL
#define BIT62 0x4000000000000000ULL
#define BIT63 0x8000000000000000ULL

#define SIZE_1KB 0x00000400
#define SIZE_2KB 0x00000800
#define SIZE_4KB 0x00001000
#define SIZE_8KB 0x00002000
#define SIZE_16KB 0x00004000
#define SIZE_32KB 0x00008000
#define SIZE_64KB 0x00010000
#define SIZE_128KB 0x00020000
#define SIZE_256KB 0x00040000
#define SIZE_512KB 0x00080000
#define SIZE_1MB 0x00100000
#define SIZE_2MB 0x00200000
#define SIZE_4MB 0x00400000
#define SIZE_8MB 0x00800000
#define SIZE_16MB 0x01000000
#define SIZE_32MB 0x02000000
#define SIZE_64MB 0x04000000
#define SIZE_128MB 0x08000000
#define SIZE_256MB 0x10000000
#define SIZE_512MB 0x20000000
#define SIZE_1GB 0x40000000
#define SIZE_2GB 0x80000000
#define SIZE_4GB 0x0000000100000000ULL
#define SIZE_8GB 0x0000000200000000ULL
#define SIZE_16GB 0x0000000400000000ULL
#define SIZE_32GB 0x0000000800000000ULL
#define SIZE_64GB 0x0000001000000000ULL
#define SIZE_128GB 0x0000002000000000ULL
#define SIZE_256GB 0x0000004000000000ULL
#define SIZE_512GB 0x0000008000000000ULL
#define SIZE_1TB 0x0000010000000000ULL
#define SIZE_2TB 0x0000020000000000ULL
#define SIZE_4TB 0x0000040000000000ULL
#define SIZE_8TB 0x0000080000000000ULL
#define SIZE_16TB 0x0000100000000000ULL
#define SIZE_32TB 0x0000200000000000ULL
#define SIZE_64TB 0x0000400000000000ULL
#define SIZE_128TB 0x0000800000000000ULL
#define SIZE_256TB 0x0001000000000000ULL
#define SIZE_512TB 0x0002000000000000ULL
#define SIZE_1PB 0x0004000000000000ULL
#define SIZE_2PB 0x0008000000000000ULL
#define SIZE_4PB 0x0010000000000000ULL
#define SIZE_8PB 0x0020000000000000ULL
#define SIZE_16PB 0x0040000000000000ULL
#define SIZE_32PB 0x0080000000000000ULL
#define SIZE_64PB 0x0100000000000000ULL
#define SIZE_128PB 0x0200000000000000ULL
#define SIZE_256PB 0x0400000000000000ULL
#define SIZE_512PB 0x0800000000000000ULL
#define SIZE_1EB 0x1000000000000000ULL
#define SIZE_2EB 0x2000000000000000ULL
#define SIZE_4EB 0x4000000000000000ULL
#define SIZE_8EB 0x8000000000000000ULL

#define BASE_1KB 0x00000400
#define BASE_2KB 0x00000800
#define BASE_4KB 0x00001000
#define BASE_8KB 0x00002000
#define BASE_16KB 0x00004000
#define BASE_32KB 0x00008000
#define BASE_64KB 0x00010000
#define BASE_128KB 0x00020000
#define BASE_256KB 0x00040000
#define BASE_512KB 0x00080000
#define BASE_1MB 0x00100000
#define BASE_2MB 0x00200000
#define BASE_4MB 0x00400000
#define BASE_8MB 0x00800000
#define BASE_16MB 0x01000000
#define BASE_32MB 0x02000000
#define BASE_64MB 0x04000000
#define BASE_128MB 0x08000000
#define BASE_256MB 0x10000000
#define BASE_512MB 0x20000000
#define BASE_1GB 0x40000000
#define BASE_2GB 0x80000000
#define BASE_4GB 0x0000000100000000ULL
#define BASE_8GB 0x0000000200000000ULL
#define BASE_16GB 0x0000000400000000ULL
#define BASE_32GB 0x0000000800000000ULL
#define BASE_64GB 0x0000001000000000ULL
#define BASE_128GB 0x0000002000000000ULL
#define BASE_256GB 0x0000004000000000ULL
#define BASE_512GB 0x0000008000000000ULL
#define BASE_1TB 0x0000010000000000ULL
#define BASE_2TB 0x0000020000000000ULL
#define BASE_4TB 0x0000040000000000ULL
#define BASE_8TB 0x0000080000000000ULL
#define BASE_16TB 0x0000100000000000ULL
#define BASE_32TB 0x0000200000000000ULL
#define BASE_64TB 0x0000400000000000ULL
#define BASE_128TB 0x0000800000000000ULL
#define BASE_256TB 0x0001000000000000ULL
#define BASE_512TB 0x0002000000000000ULL
#define BASE_1PB 0x0004000000000000ULL
#define BASE_2PB 0x0008000000000000ULL
#define BASE_4PB 0x0010000000000000ULL
#define BASE_8PB 0x0020000000000000ULL
#define BASE_16PB 0x0040000000000000ULL
#define BASE_32PB 0x0080000000000000ULL
#define BASE_64PB 0x0100000000000000ULL
#define BASE_128PB 0x0200000000000000ULL
#define BASE_256PB 0x0400000000000000ULL
#define BASE_512PB 0x0800000000000000ULL
#define BASE_1EB 0x1000000000000000ULL
#define BASE_2EB 0x2000000000000000ULL
#define BASE_4EB 0x4000000000000000ULL
#define BASE_8EB 0x8000000000000000ULL
# 582 "./edk2/MdePkg/Include/Base.h"
#define _INT_SIZE_OF(n) ((sizeof(n) + sizeof(UINTN) - 1) & ~(sizeof(UINTN) - 1))
# 630 "./edk2/MdePkg/Include/Base.h"
typedef int VA_LIST;

#define VA_START(Marker,Parameter) __builtin_va_start(Marker, Parameter)

#define VA_ARG(Marker,TYPE) ((sizeof(TYPE) < sizeof(UINTN)) ? (TYPE)(__builtin_va_arg(Marker, UINTN)) : (TYPE)(__builtin_va_arg(Marker, TYPE)))

#define VA_END(Marker) __builtin_va_end(Marker)

#define VA_COPY(Dest,Start) __builtin_va_copy(Dest, Start)
# 716 "./edk2/MdePkg/Include/Base.h"
typedef UINTN *BASE_LIST;








#define _BASE_INT_SIZE_OF(TYPE) ((sizeof(TYPE) + sizeof(UINTN) - 1) / sizeof(UINTN))
# 743 "./edk2/MdePkg/Include/Base.h"
#define BASE_ARG(Marker,TYPE) (*(TYPE *)((Marker += _BASE_INT_SIZE_OF(TYPE)) - _BASE_INT_SIZE_OF(TYPE)))
# 759 "./edk2/MdePkg/Include/Base.h"
#define OFFSET_OF(TYPE,Field) ((UINTN) __builtin_offsetof(TYPE, Field))
# 783 "./edk2/MdePkg/Include/Base.h"
#define ALIGNOF(TYPE) _Alignof(TYPE)
# 813 "./edk2/MdePkg/Include/Base.h"
#define STATIC_ASSERT _Static_assert







_Static_assert(sizeof(BOOLEAN) == 1, "sizeof (BOOLEAN) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(INT8) == 1, "sizeof (INT8) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(UINT8) == 1, "sizeof (UINT8) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(INT16) == 2, "sizeof (INT16) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(UINT16) == 2, "sizeof (UINT16) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(INT32) == 4, "sizeof (INT32) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(UINT32) == 4, "sizeof (UINT32) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(INT64) == 8, "sizeof (INT64) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(UINT64) == 8, "sizeof (UINT64) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(CHAR8) == 1, "sizeof (CHAR8) does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(CHAR16) == 2, "sizeof (CHAR16) does not meet UEFI Specification Data Type requirements");



_Static_assert(_Alignof(BOOLEAN) == sizeof(BOOLEAN), "Alignment of BOOLEAN does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(INT8) == sizeof(INT8), "Alignment of INT8 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(UINT8) == sizeof(UINT8), "Alignment of INT16 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(INT16) == sizeof(INT16), "Alignment of INT16 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(UINT16) == sizeof(UINT16), "Alignment of UINT16 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(INT32) == sizeof(INT32), "Alignment of INT32 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(UINT32) == sizeof(UINT32), "Alignment of UINT32 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(INT64) == sizeof(INT64), "Alignment of INT64 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(UINT64) == sizeof(UINT64), "Alignment of UINT64 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(CHAR8) == sizeof(CHAR8), "Alignment of CHAR8 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(CHAR16) == sizeof(CHAR16), "Alignment of CHAR16 does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(INTN) == sizeof(INTN), "Alignment of INTN does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(UINTN) == sizeof(UINTN), "Alignment of UINTN does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(void *) == sizeof(void *), "Alignment of VOID * does not meet UEFI Specification Data Type requirements");
# 857 "./edk2/MdePkg/Include/Base.h"
typedef enum
{
  __VerifyUint8EnumValue = 0xff
} __VERIFY_UINT8_ENUM_SIZE;

typedef enum
{
  __VerifyUint16EnumValue = 0xffff
} __VERIFY_UINT16_ENUM_SIZE;

typedef enum
{
  __VerifyInt32EnumValue = 0x7fffffff
} __VERIFY_INT32_ENUM_SIZE;

_Static_assert(sizeof(__VERIFY_UINT8_ENUM_SIZE) == 4, "Size of enum does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(__VERIFY_UINT16_ENUM_SIZE) == 4, "Size of enum does not meet UEFI Specification Data Type requirements");
_Static_assert(sizeof(__VERIFY_INT32_ENUM_SIZE) == 4, "Size of enum does not meet UEFI Specification Data Type requirements");

_Static_assert(_Alignof(__VERIFY_UINT8_ENUM_SIZE) == sizeof(__VERIFY_UINT8_ENUM_SIZE), "Alignment of enum does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(__VERIFY_UINT16_ENUM_SIZE) == sizeof(__VERIFY_UINT16_ENUM_SIZE), "Alignment of enum does not meet UEFI Specification Data Type requirements");
_Static_assert(_Alignof(__VERIFY_INT32_ENUM_SIZE) == sizeof(__VERIFY_INT32_ENUM_SIZE), "Alignment of enum does not meet UEFI Specification Data Type requirements");
# 899 "./edk2/MdePkg/Include/Base.h"
#define BASE_CR(Record,TYPE,Field) ((TYPE *)((CHAR8 *)(Record) - OFFSET_OF(TYPE, Field)))
# 909 "./edk2/MdePkg/Include/Base.h"
#define IS_POW2(Value) ((Value) != 0U && ((Value) & ((Value) - 1U)) == 0U)
# 920 "./edk2/MdePkg/Include/Base.h"
#define IS_ALIGNED(Value,Alignment) (((Value) & ((Alignment) - 1U)) == 0U)
